<?php
return [
	'authPage' => [
		'error' => 'Ошибка авторизации',
		'login' => 'Логин',
		'pass' => 'Пароль',
		'enter' => 'Войти',
		'ask' => 'Нет учетной записи?',
		'join' => 'Зарегистрироваться',
	],
	'regPage' => [
		'error' => 'Ошибка при регистрации',
		'login' => 'Войти',
		'pass' => 'Пароль',
		'name' => 'Имя',
		'email' => 'Е-мейл',
		'ask' => 'Уже зарегистрированы?',
		'reg' => 'Регистрация',
        'agree' => 'Нажимая на кнопку "Регистрация", я подтверждаю, что являюсь совершеннолетним дееспособным лицом.'
	],
	'profile' => [
		'name' => 'Имя',
		'email' => 'Е-мейл',
		'exit' => 'Выйти',
		'usersList' => 'Начни общаться!',
		'update' => 'Обновить',
		'userpic' => 'Аватар',
		'selectFile' => 'Выбрать файл',
		'notSelected' => 'Файл не выбран',
		'fileIsUndefined' => 'Файл не был передан',
		'fileUploadError' => 'Ошибка загрузки файла',
		'sex' => [
			'title' => 'Пол',
			'select' => 'Сделайте выбор',
			'man' => 'Мужской',
			'woman' => 'Женский'
		],
        'userSearch' => 'Найди друга тут...',
	],
	'allUsers' => [
		'profile' => '(ред.)',
		'exit' => 'Выйти',
        'userSearch' => 'Найди друга тут...',
	],
	'chatPage' => [
		'profile' => '(ред.)',
		'exit' => 'Выйти',
		'allUsers' => 'Начни общаться!',
        'emptyText' => 'Напишите что-нибудь собеседнику:)',
        'userSearch' => 'Найди друга тут...',
	],
	'messages' => [
	    'conflict' => 'Конфликт в процессе',
		'forbidden' => 'Нет доступа',
		'notCreated' => 'Сообщение не было доставлено',
		'messagesNotFound' => 'С данным пользователем переписки нет',
	],
    'favorites' => [
        'notCreated' => 'Ошибка добавления'
    ]
];