<?php
return [
    'main' => [
        'login' => 'Логин',
        'pass' => 'Пароль',
        'name' => 'Имя',
        'email' => 'Е-мейл',
        'exit' => 'Выйти',
        'usersList' => 'Начни общаться!',
        'userSearch' => 'Найди друга тут...',
        'profile' => '(ред.)',
        'conflict' => 'Конфликт в процессе',
        'forbidden' => 'Нет доступа',
        'favorites' => 'Фавориты'
    ],
	'authPage' => [
		'error' => 'Ошибка авторизации',
		'enter' => 'Войти',
		'ask' => 'Нет учетной записи?',
		'join' => 'Зарегистрироваться',
	],
	'regPage' => [
		'error' => 'Ошибка при регистрации',
		'ask' => 'Уже зарегистрированы?',
		'reg' => 'Регистрация',
        'agree' => 'Нажимая на кнопку "Регистрация", я подтверждаю, что являюсь совершеннолетним дееспособным лицом.'
	],
	'profile' => [
		'update' => 'Обновить',
		'userpic' => 'Аватар',
		'selectFile' => 'Выбрать файл',
		'notSelected' => 'Файл не выбран',
		'fileIsUndefined' => 'Файл не был передан',
		'fileUploadError' => 'Ошибка загрузки файла',
		'sex' => [
			'title' => 'Пол',
			'select' => 'Сделайте выбор',
			'man' => 'Мужской',
			'woman' => 'Женский'
		],
	],
	'chatPage' => [
        'emptyText' => 'Напишите что-нибудь собеседнику:)',
	],
	'messages' => [
		'notCreated' => 'Сообщение не было доставлено',
		'messagesNotFound' => 'С данным пользователем переписки нет',
	],
    'favorites' => [
        'notCreated' => 'Ошибка добавления',
        'notDeleted' => 'Ошибка удаления',
        'listIsEmpty' => 'Список пуст. Найдите ваших знакомых и друзей через поиск и добавьте их в фавориты!'
    ],
];